app/controllers/administrations_controller.rb

INSERT INTO "administrations" ("admin_id", "created_at", "managinggroup_id", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["admin_id", 1], ["created_at", Sat, 20 Oct 2012 15:46:30 UTC +00:00], ["managinggroup_id", 1], ["updated_at", Sat, 20 Oct 2012 15:46:30 UTC +00:00]]
---
  def create
  	admin_id = params[:user_id]
    managinggroup_id = params[:group_id]
    @administration = Administration.new(admin_id: admin_id, managinggroup_id: managinggroup_id)
    if @administration.save