app/controllers/groups_controller.rb

SELECT "users".* FROM "users" WHERE "users"."id" = $1 LIMIT 1  [["id", "2"]]
---
  def create
  	name = params[:name]
    creator_id = params[:creator_id]

    if name.nil?
      render_error(404, request.path, 20100, "Group name is null.") and return
    elsif creator_id.nil?
      render_error(404, request.path, 20100, "creator_id is null.") and return
    end

    @creator = User.find(creator_id)