app/controllers/groups_controller.rb

  def create
    name = params[:name]
    current_user = auth_user
    if current_user
      @group = Group.new(name: name, creator_id: current_user.id)
      if @group.save
        @membership = Membership.new(user_id: current_user.id, group_id: @group.id)
          if @membership.save
            respond_with(@group, only: [:id, :name, :creator_id, :admin_id])
          else
            render_error(404, request.path, 20109, @membership.errors.as_json)
          end
      else
        render_error(404, request.path, 20101, @group.errors.as_json)
      end
    end
  end

=begin
        elsif @group.errors[:name].any?
---
INSERT INTO "groups" ("created_at", "depth", "lft", "name", "parent_id", "rgt", "updated_at") VALUES ($1, $2, $3, $4, $5, $6, $7) RETURNING "id"  [["created_at", Sat, 20 Oct 2012 15:06:04 UTC +00:00], ["depth", nil], ["lft", 1], ["name", "Testing"], ["parent_id", nil], ["rgt", 2], ["updated_at", Sat, 20 Oct 2012 15:06:04 UTC +00:00]]
INSERT INTO "memberships" ("created_at", "group_id", "updated_at", "user_id") VALUES ($1, $2, $3, $4) RETURNING "id"  [["created_at", Sat, 20 Oct 2012 16:20:49 UTC +00:00], ["group_id", 3], ["updated_at", Sat, 20 Oct 2012 16:20:49 UTC +00:00], ["user_id", 1]]
SELECT "groups".* FROM "groups" WHERE "groups"."name" = 'Testing' LIMIT 1
SELECT 1 AS one FROM "groups" WHERE LOWER("groups"."name") = LOWER('testing') LIMIT 1
SELECT 1 AS one FROM "memberships" WHERE ("memberships"."user_id" = 1 AND "memberships"."group_id" = 6) LIMIT 1

  def is_admin
    group_id = params[:group_id]
    user_id  = params[:user_id].to_i
    group = Group.find(group_id)
---
SELECT "groups".* FROM "groups" WHERE "groups"."id" = ? LIMIT 1  [["id", "1"]]

  def is_creator
    group_id = params[:group_id]
    user_id  = params[:user_id].to_i
    group = Group.find(group_id)
---
SELECT "groups".* FROM "groups" WHERE "groups"."id" = ? LIMIT 1  [["id", "1"]]

  def is_member
    @group = Group.find(params[:group_id])
    if @group
      @user = User.find(params[:user_id])
---
SELECT "groups".* FROM "groups" WHERE "groups"."id" = ? LIMIT 1  [["id", "4"]]
SELECT "users".* FROM "users" WHERE "users"."id" = 1 LIMIT 1

  def count
    @group = Group.find(params[:group_id])
    if @group
      render json: {count: @group.users.count}
---
SELECT "groups".* FROM "groups" WHERE "groups"."id" = ? LIMIT 1  [["id", "4"]]
SELECT COUNT(*) FROM "users" INNER JOIN "memberships" ON "users"."id" = "memberships"."user_id" WHERE "memberships"."group_id" = 4

  def show
    @current_user = auth_user
    if @current_user
      @group = Group.find(params[:group_id])
---
SELECT "groups".* FROM "groups" WHERE "groups"."id" = ? LIMIT 1  [["id", "2"]]

  def update
    @group = Group.find(params[:group_id])
    if current_user_is_admin?(@group)
      if @group.update_attributes(params[:group])
---
SELECT "groups".* FROM "groups" WHERE "groups"."id" = ? LIMIT 1  [["id", "5"]]
UPDATE "groups" SET "name" = 'success', "updated_at" = '2012-11-06 19:12:50.315130' WHERE "groups"."id" = 5

  def destroy
    @group = Group.find(params[:group_id])
    if current_user_is_admin?(@group)
      if @group.destroy
---
SELECT "groups".* FROM "groups" WHERE "groups"."id" = ? LIMIT 1  [["id", "1"]]
DELETE FROM "groups" WHERE "groups"."id" = ?  [["id", 1]]

  def transfer_admin
    @group = Group.find(params[:group_id])
    if current_user_is_admin?(@group)
      new_admin_id = params[:new_admin_id].to_i
      @new_admin = User.find(new_admin_id)
      if @new_admin
        if is_member?(@group, @new_admin)
          if new_admin_id == @group.admin_id
            render_error(404, request.path, 20111, "Cannot transfer rights to yourself.")
          else
            if @group.update_attributes(admin_id: new_admin_id)
---
SELECT "groups".* FROM "groups" WHERE "groups"."id" = ? LIMIT 1  [["id", "4"]]
SELECT "users".* FROM "users" WHERE "users"."id" = ? LIMIT 1  [["id", "2"]]
UPDATE "groups" SET "admin_id" = 2, "updated_at" = '2012-11-06 18:05:14.760597' WHERE "groups"."id" = 3