app/controllers/memberships_controller.rb

SELECT "users".* FROM "users" WHERE "users"."id" = 1 LIMIT 1
SELECT "groups".* FROM "groups" WHERE "groups"."id" = ? LIMIT 1  [["id", "4"]]
INSERT INTO "memberships" ("created_at", "group_id", "updated_at", "user_id") VALUES ($1, $2, $3, $4) RETURNING "id"  [["created_at", Sat, 20 Oct 2012 14:22:39 UTC +00:00], ["group_id", 1], ["updated_at", Sat, 20 Oct 2012 14:22:39 UTC +00:00], ["user_id", 1]]
SELECT COUNT(*) FROM "users" INNER JOIN "memberships" ON "users"."id" = "memberships"."user_id" WHERE "memberships"."group_id" = 4
---
  def create
    if current_user_is_admin
      user_id = params[:user_id]
      group_id = params[:group_id]
      @user = User.find(user_id)
      @group = Group.find(group_id)
      if @user
        if is_member?(@group, @user)
          render_error(404, request.path, 20100,
                      "User is already a member.") and return
        else
          @membership = Membership.new(user_id: user_id,
                                       group_id: group_id)
          if @membership.save
            render json: { group_name: @group.name,
                           user_count: @group.users.count }

SELECT "users".* FROM "users" WHERE "users"."id" = ? LIMIT 1  [["id", "20"]]
SELECT "groups".* FROM "groups" WHERE "groups"."id" = ? LIMIT 1  [["id", "4"]]
SELECT "memberships".* FROM "memberships" WHERE "memberships"."user_id" = 20 AND "memberships"."group_id" = 4 LIMIT 1
DELETE FROM "memberships" WHERE "memberships"."id" = ?  [["id", 13]]
---
  def destroy
    if current_user_is_member
      user_id = params[:user_id].to_i
      group_id = params[:group_id]
      @user = User.find(user_id)
      @group = Group.find(group_id)
      if @user && @group
        if is_member?(@group, @user)
          if user_id == @group.admin_id
            render_error(404, request.path, 20006, "Admin could not leave the group.") and return
          elsif delete_by_admin_or_self(@group, user_id)
            @membership = Membership.find_by_user_id_and_group_id(user_id, group_id)
            if @membership.destroy