app/controllers/replies_controller.rb

  def show
    @reply = Reply.find(params[:id])
---
SELECT "replies".* FROM "replies" WHERE "replies"."id" = ? LIMIT 1  [["id", "1"]]