app/controllers/sessions_controller.rb

  def destroy
    if @current_user.token.destroy
---
DELETE FROM "tokens" WHERE "tokens"."id" = $1  [["id", 24]]