app/controllers/sessions_controller.rb

SELECT "users".* FROM "users" WHERE "users"."email" = 'example@rails.com' LIMIT 1
---
  def create
    email = params[:email]
    password = params[:password]

    if request.format != :json
      render_error(406, request.path, 20000, "The request must be json.")
      return
    end

    if email.nil? or password.nil?
      render_error(400, request.path, 20004, "Both email and password required.")
      return
    end

    @user = User.find_by_email(email.downcase)