app/controllers/users_controller.rb

  def create
    email      = params[:email]
    password   = params[:password]
    first_name = params[:first_name]
    last_name  = params[:last_name]
    @user = User.new(email: email, password: password,
                     first_name: first_name, last_name: last_name)
    if @user.save
      respond_with(@user, only: [:id, :email])
    else
      render_error(404, request.path, 20001, @user.errors.as_json)
    end
  end

=begin
    elsif @user.errors[:first_name].any?
---
INSERT INTO "users" ("created_at", "email", "first_name", "last_name", "password_digest", "remember_token", "updated_at") VALUES ($1, $2, $3, $4, $5, $6, $7) RETURNING "id"
SELECT 1 AS one FROM "users" WHERE LOWER("users"."email") = LOWER('example@gmail.com') LIMIT 1

  def show
    @user = User.find(params[:user_id])
---
SELECT "users".* FROM "users" WHERE "users"."id" = $1 LIMIT 1  [["id", "10"]]

  def update
    # only change password
    # needs to be improved
    @user = User.find(params[:user_id])
    if current_user_is_referred_user?(@user)
      if @user.update_attributes(params[:user])
---
SELECT "users".* FROM "users" WHERE "users"."id" = $1 LIMIT 1  [["id", "15"]]
UPDATE "users" SET "password_digest" = '$2a$10$TIVKUYcdJ4Jd3DQ7rrM4ce622ALteK6FKfT1zl30pDyeRG.z1Jf/.', "email" = 'onceagain@gmail.com', "updated_at" = '2012-11-04 16:04:43.539135' WHERE "users"."id" = 17

  def destroy
    if current_user.destroy
      render json: {request: request.path, message: "You have successfully logged off."}
    else
      render_error(404, request.path, 20006, "Logoff failed.")
    end
    @user = User.find(params[:user_id])
---
DELETE FROM "users" WHERE "users"."id" = $1  [["id", 14]]
SELECT "users".* FROM "users" WHERE "users"."id" = $1 LIMIT 1  [["id", 14]]